tap "chef/chef"
tap "cloudflare/cloudflare"
tap "datawire/blackbird"
tap "go-task/tap"
tap "redpanda-data/tap"
tap "snyk/tap"
tap "teamookla/speedtest"
brew "argocd"
brew "autoconf"
brew "automake"
brew "azure-cli"
brew "bash"
brew "bat"
brew "bats-core"
brew "bison"
brew "bzip2"
brew "cf-terraforming"
brew "chruby"
brew "cloudflared"
brew "consul"
brew "coreutils"
brew "ctags"
brew "datawire/blackbird/telepresence-arm64"
brew "driftctl"
brew "exa"
brew "fd"
brew "findutils"
brew "fzf"
brew "gdbm"
brew "gettext"
brew "ggshield"
brew "gh"
brew "git"
brew "git-lfs"
brew "glances"
brew "gmp"
brew "gnupg"
brew "go"
brew "go-task/tap/go-task"
brew "hadolint"
brew "helm"
brew "htop"
brew "httpie"
brew "icu4c@78"
brew "imagemagick"
brew "iperf3"
brew "jpeg"
brew "jq"
brew "k3d"
brew "k9s"
brew "keychain"
brew "kind"
brew "kops"
brew "kubernetes-cli"
brew "kustomize"
brew "lazydocker"
brew "ldns"
brew "libffi"
brew "libidn2"
brew "libpng"
brew "libtiff"
brew "libtool"
brew "libunistring"
brew "libyaml"
brew "linkerd"
brew "make"
brew "mas"
brew "mintoolkit"
brew "mongosh"
brew "mongodb-atlas-cli"
brew "mpfr"
brew "mysql"
brew "ncdu"
brew "neovim"
brew "node"
brew "nomad"
brew "ntfy"
brew "openssl@3"
brew "packer"
brew "pcre"
brew "perl"
brew "pkgconf"
brew "postgresql@14"
brew "postgresql@15"
brew "pwgen"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.13"
brew "rancher-cli"
brew "ranger"
brew "readline"
brew "redis", restart_service: :changed, link: true
brew "redpanda-data/tap/redpanda"
brew "ripgrep"
brew "ruby"
brew "ruby-install"
brew "rustup"
brew "shellcheck"
brew "snyk/tap/snyk"
brew "sops"
brew "sqlite"
brew "starship"
brew "teamookla/speedtest/speedtest"
brew "teleport"
brew "terraform_landscape"
brew "tfenv"
brew "tflint"
brew "tfsec"
brew "tgenv"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
#brew "vault", args: ["--with-ui"]
brew "vault"
brew "vim"
brew "wget"
brew "wireshark"
brew "xz"
brew "yq"
brew "zlib"
brew "zoxide"
brew "zsh"
brew "zsh-completions"
cask "1password"
cask "adobe-acrobat-reader"
cask "adobe-creative-cloud"
cask "alfred"
cask "appcleaner"
cask "balenaetcher"
cask "bambu-studio"
cask "beyond-compare"
cask "blender"
cask "carbon-copy-cloner"
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "cursor"
cask "cursor-cli"
cask "daisydisk"
cask "dbeaver-community"
cask "discord"
cask "docker"
cask "docker-desktop"
cask "dotnet"
cask "dotnet-runtime"
cask "expressvpn"
cask "firefox"
cask "flycut"
cask "fork"
cask "funter"
cask "gcloud-cli"
cask "github"
cask "google-chrome"
cask "google-cloud-sdk"
cask "inspec"
cask "istat-menus"
cask "iterm2"
cask "lens"
cask "logi-options+"
cask "macdown"
cask "malwarebytes"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "miro"
cask "mysqlworkbench"
cask "obs"
cask "oracle-jdk"
cask "postman"
cask "powershell"
cask "session-manager-plugin"
cask "slack"
cask "sonos"
cask "sourcetree"
cask "spotify"
cask "steam"
cask "teamviewer"
cask "tidal"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "zed"
cask "zoom"
mas "Better Rename 9", id: 414209656
mas "Blackmagic Disk Speed Test", id: 425264550
mas "Brother iPrint&Scan", id: 1193539993
mas "Flycut", id: 442160987
mas "iNet Network Scanner", id: 403304796
mas "Mactracker", id: 430255202
mas "Magnet", id: 441258766
mas "Markoff", id: 1084713122
mas "Microsoft Remote Desktop", id: 715768417
mas "Remote Desktop", id: 409907375
mas "Simplenote", id: 692867256
mas "Speedtest", id: 1153157709
mas "Sync Folders Pro", id: 522706442
mas "The Unarchiver", id: 425424353
mas "Transmit", id: 403388562
