tap "cloudflare/cloudflare"                  # [HAS_DEVTOOLS]
tap "getagentseal/codeburn"                  # [HAS_DEVTOOLS]
tap "datawire/blackbird"                     # [HAS_K8S]
tap "go-task/tap"                            # [HAS_DEVTOOLS]
tap "oven-sh/bun"                            # [HAS_DEVTOOLS]
tap "redpanda-data/tap"                      # [HAS_DEVTOOLS]
tap "snyk/tap"                               # [HAS_DEVTOOLS]
tap "teamookla/speedtest"                    # [HAS_DEVTOOLS]
brew "argocd"                                # [HAS_K8S]
brew "autoconf"                              # [HAS_DEVTOOLS]
brew "automake"                              # [HAS_DEVTOOLS]
brew "azure-cli"                             # [HAS_DEVTOOLS]
brew "bash"
brew "bat"
brew "bats-core"                             # [HAS_DEVTOOLS]
brew "bison"                                 # [HAS_DEVTOOLS]
brew "oven-sh/bun/bun"                       # [HAS_DEVTOOLS]
brew "bzip2"
brew "chruby"                                # [HAS_DEVTOOLS]
brew "codeburn"                              # [HAS_DEVTOOLS]
brew "cloudflared"                           # [HAS_DEVTOOLS]
brew "consul"                                # [HAS_DEVTOOLS]
brew "coreutils"
brew "ctags"                                 # [HAS_DEVTOOLS]
brew "datawire/blackbird/telepresence-arm64" # [HAS_K8S]
brew "driftctl"                              # [HAS_DEVTOOLS]
brew "entr"                                  # [HAS_DEVTOOLS]
brew "fd"                                    # [HAS_DEVTOOLS]
brew "findutils"
brew "fzf"                                   # [HAS_DEVTOOLS]
brew "gdbm"
brew "gettext"
brew "ggshield"                              # [HAS_DEVTOOLS]
brew "gh"                                    # [HAS_DEVTOOLS]
brew "git"
brew "git-lfs"                               # [HAS_DEVTOOLS]
brew "git-cliff"                             # changelog generation from conventional commits
brew "glances"                               # [HAS_DEVTOOLS]
brew "gmp"
brew "gnupg"                                 # [HAS_DEVTOOLS]
brew "go"                                    # [HAS_DEVTOOLS]
brew "go-task/tap/go-task"                   # [HAS_DEVTOOLS]
brew "hadolint"                              # [HAS_DOCKER]
brew "helm"                                  # [HAS_K8S]
brew "htop"
brew "httpie"                                # [HAS_DEVTOOLS]
brew "icu4c@78"
brew "imagemagick"                           # [HAS_DEVTOOLS]
brew "iperf3"                                # [HAS_DEVTOOLS]
brew "jpeg"
brew "jq"
brew "k3d"                                   # [HAS_K8S]
brew "k9s"                                   # [HAS_K8S]
brew "kcov"                                   # [HAS_DEVTOOLS]
brew "keychain"
brew "kind"                                  # [HAS_K8S]
brew "kops"                                  # [HAS_K8S]
brew "kubernetes-cli"                        # [HAS_K8S]
brew "kustomize"                             # [HAS_K8S]
brew "lazydocker"                            # [HAS_DOCKER]
brew "ldns"                                  # [HAS_DEVTOOLS]
brew "libffi"
brew "libidn2"
brew "libpng"
brew "libtiff"
brew "libtool"
brew "libunistring"
brew "libyaml"
brew "linkerd"                               # [HAS_K8S]
brew "make"
brew "mas"                                   # [HAS_PRINTING]
brew "mdbook"                                # [HAS_DEVTOOLS]
brew "mintoolkit"                            # [HAS_DEVTOOLS]
brew "mongosh"                               # [HAS_DEVTOOLS]
brew "mongodb-atlas-cli"                     # [HAS_DEVTOOLS]
brew "mpfr"
brew "mysql"                                 # [HAS_DEVTOOLS]
brew "ncdu"
brew "neovim"                                # [HAS_DEVTOOLS]
brew "node"                                  # [HAS_DEVTOOLS]
brew "nomad"                                 # [HAS_DEVTOOLS]
brew "ntfy"                                  # [HAS_DEVTOOLS]
brew "openssl@3"
brew "packer"                                # [HAS_DEVTOOLS]
brew "pcre"
brew "perl"                                  # [HAS_DEVTOOLS]
brew "pkgconf"
brew "postgresql@15"                         # [HAS_DEVTOOLS]
brew "powershell"                            # [HAS_DEVTOOLS]
brew "pwgen"
brew "pyenv"                                 # [HAS_DEVTOOLS]
brew "pyright"                               # [HAS_DEVTOOLS]
brew "pyenv-virtualenv"                      # [HAS_DEVTOOLS]
brew "python@3.13"                           # [HAS_DEVTOOLS]
brew "rancher-cli"                           # [HAS_K8S]
brew "ranger"                                # [HAS_DEVTOOLS]
brew "readline"
brew "redis", restart_service: :changed, link: true  # [HAS_DEVTOOLS]
brew "redpanda-data/tap/redpanda"            # [HAS_DEVTOOLS]
brew "ripgrep"                               # [HAS_DEVTOOLS]
brew "ruby"                                  # [HAS_DEVTOOLS]
brew "ruby-install"                          # [HAS_DEVTOOLS]
brew "cargo-nextest"                         # [HAS_RUST]
brew "cargo-cyclonedx"                       # [HAS_RUST]
brew "cyclonedx-python"
brew "rust-analyzer"                         # [HAS_RUST]
brew "rustup"                                # [HAS_RUST]
brew "shellcheck"                            # [HAS_DEVTOOLS]
brew "snyk/tap/snyk"                         # [HAS_DEVTOOLS]
brew "sops"                                  # [HAS_DEVTOOLS]
brew "sqlite"
brew "starship"                              # [HAS_DEVTOOLS]
brew "teamookla/speedtest/speedtest"         # [HAS_DEVTOOLS]
brew "teleport"                              # [HAS_DEVTOOLS]
brew "opentofu"                              # [HAS_DEVTOOLS]
brew "terraform_landscape"                   # [HAS_DEVTOOLS]
brew "tfenv"                                 # [HAS_DEVTOOLS]
brew "tflint"                                # [HAS_DEVTOOLS]
brew "tfsec"                                 # [HAS_DEVTOOLS]
brew "tgenv"                                 # [HAS_DEVTOOLS]
brew "the_silver_searcher"                   # [HAS_DEVTOOLS]
brew "tmux"
brew "tree"
#brew "vault", args: ["--with-ui"]
brew "vault"                                 # [HAS_DEVTOOLS]
brew "vim"
brew "wget"
brew "wireshark"                             # [HAS_DEVTOOLS]
brew "xz"
brew "yq"                                    # [HAS_DEVTOOLS]
brew "zlib"
brew "zig"                                   # [HAS_DEVTOOLS]
brew "zoxide"                                # [HAS_DEVTOOLS]
brew "zsh"
brew "zsh-completions"
cask "1password"
cask "adobe-acrobat-reader"
cask "adobe-creative-cloud"                  # [HAS_DEVTOOLS]
cask "alfred"
cask "appcleaner"
cask "balenaetcher"                          # [HAS_DEVTOOLS]
cask "bambu-studio"                          # [HAS_DEVTOOLS]
cask "beyond-compare"                        # [HAS_DEVTOOLS]
cask "blender"                               # [HAS_DEVTOOLS]
cask "carbon-copy-cloner"                    # [HAS_DEVTOOLS]
cask "chatgpt"
cask "claude"
cask "claude-code"                           # [HAS_DEVTOOLS]
cask "cursor"                                # [HAS_DEVTOOLS]
cask "cursor-cli"                            # [HAS_DEVTOOLS]
cask "daisydisk"
cask "dbeaver-community"                     # [HAS_DEVTOOLS]
cask "discord"
cask "docker-desktop"                        # [HAS_DOCKER]
cask "dotnet-runtime"
cask "expressvpn"                            # [HAS_DEVTOOLS]
cask "firefox"
cask "flycut"
cask "fork"                                  # [HAS_DEVTOOLS]
cask "funter"                                # [HAS_DEVTOOLS]
cask "gcloud-cli"                            # [HAS_DEVTOOLS]
cask "github"                                # [HAS_DEVTOOLS]
cask "google-chrome"
cask "iina"
cask "inspec"                                # [HAS_DEVTOOLS]
cask "istat-menus"
cask "iterm2"                                # [HAS_DEVTOOLS]
cask "lens"                                  # [HAS_K8S]
cask "logi-options+"
cask "macdown"
cask "malwarebytes"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "miro"
cask "mysqlworkbench"                        # [HAS_DEVTOOLS]
cask "obs"
cask "oracle-jdk"                            # [HAS_DEVTOOLS]
cask "postman"                               # [HAS_DEVTOOLS]
cask "session-manager-plugin"               # [HAS_AWS]
cask "slack"
cask "sonos"
cask "sourcetree"                            # [HAS_DEVTOOLS]
cask "spotify"
cask "steam"                                 # [HAS_DEVTOOLS]
cask "teamviewer"
cask "tidal"
cask "vagrant"                               # [HAS_DEVTOOLS]
cask "virtualbox"                            # [HAS_DEVTOOLS]
cask "visual-studio-code"
cask "vlc"
cask "warp"                                  # [HAS_DEVTOOLS]
cask "zed"                                   # [HAS_DEVTOOLS]
cask "zoom"
mas "Better Rename 9", id: 414209656
mas "Blackmagic Disk Speed Test", id: 425264550
mas "Brother iPrint&Scan", id: 1193539993
mas "Flycut", id: 442160987
mas "iNet Network Scanner", id: 403304796
mas "Mactracker", id: 430255202
mas "Magnet", id: 441258766
mas "Markoff", id: 1084713122
mas "Microsoft Remote Desktop", id: 715768417
mas "Remote Desktop", id: 409907375
mas "Simplenote", id: 692867256
mas "Speedtest", id: 1153157709
mas "Sync Folders Pro", id: 522706442
mas "The Unarchiver", id: 425424353
mas "Transmit", id: 403388562
