# Brewfile.devtools — installed on HAS_DEVTOOLS machines
cask "carbon-copy-cloner"
cask "cursor"
cask "dbeaver-community"
cask "docker"
cask "fork"
cask "funter"
cask "google-cloud-sdk"
cask "lens"
cask "mysqlworkbench"
cask "oracle-jdk"
cask "postman"
cask "session-manager-plugin"
cask "sourcetree"
cask "steam"
cask "vagrant"
cask "virtualbox"
