brew "argocd"
brew "autoconf"
brew "automake"
brew "azure-cli"
brew "bash"
brew "bat"
brew "bison"
brew "bzip2"
brew "chruby"
brew "cloudflared"
brew "consul"
brew "coreutils"
brew "ctags"
brew "driftctl"
brew "docker-slim"
brew "exa"
brew "fd"
brew "findutils"
brew "fzf"
brew "gdbm"
brew "gettext"
brew "gh"
brew "git"
brew "git-lfs"
brew "glances"
brew "gh"
brew "go"
brew "gpg"
brew "hadolint"
brew "helm"
brew "htop"
brew "httpie"
brew "icu4c"
brew "iperf3"
brew "imagemagick"
brew "jpeg"
brew "jq"
brew "k3d"
brew "k9s"
brew "keychain"
brew "kind"
brew "kops"
brew "kubernetes-cli"
brew "kustomize"
brew "lazydocker"
brew "ldns"
brew "libffi"
brew "libidn2"
brew "libpng"
brew "libtiff"
brew "libtool"
brew "libunistring"
brew "libyaml"
brew "linkerd"
brew "make"
brew "mas"
brew "mongosh"
brew "mongodb-atlas"
brew "mysql"
brew "ncdu"
brew "neovim"
brew "node"
brew "nomad"
brew "openssl"
brew "packer"
brew "pcre"
brew "perl"
brew "pkg-config"
brew "postgresql@15"
brew "python3"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pwgen"
brew "ranger"
brew "rancher-cli"
brew "readline"
brew "redis", restart_service: :changed, link: true
brew "ripgrep"
brew "ruby"
brew "ruby-install"
brew "rustup"
brew "shellcheck"
brew "sops"
brew "sqlite"
brew "starship"
brew "teleport"
brew "terraform_landscape"
brew "tfenv"
brew "tflint"
brew "tfsec"
brew "tgenv"
brew "tmux"
brew "the_silver_searcher"
brew "tree"
#brew "vault", args: ["--with-ui"]
brew "vault"
brew "vim"
brew "wget"
brew "wireshark"
brew "xz"
brew "yq"
brew "zlib"
brew "zoxide"
brew "zsh"
brew "zsh-completions"
